leandroschwarz/funsapeLib/_stuff/loose_files/(DEVICE)[CHECK]tftDisplay/STM32_TFT_8bit (2).cpp
/*
 * 8bit TFT Library for STM32F103
 * based on MCUFRIEND_kbv.cpp by David Prentice
 * https://github.com/prenticedavid/MCUFRIEND_kbv
 
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.	See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.	If not, see <http://www.gnu.org/licenses/>.
 */

#include <STM32_TFT_8bit.h>
//#include <avr/pgmspace.h>
//#include <limits.h>
//#include <libmaple/dma.h>

#define MIPI_DCS_REV1					(1<<0)
#define AUTO_READINC					(1<<1)
#define READ_BGR						(1<<2)
#define READ_LOWHIGH					(1<<3)
#define READ_24BITS						(1<<4)
#define XSA_XEA_16BIT					(1<<5)
#define READ_NODUMMY					(1<<6)
#define INVERT_GS						(1<<8)
#define INVERT_SS						(1<<9)
#define MV_AXIS							(1<<10)
#define INVERT_RGB						(1<<11)
#define REV_SCREEN						(1<<12)
#define FLIP_VERT						(1<<13)
#define FLIP_HORIZ						(1<<14)

static uint8_t is8347 = 0;

// Constructor when using 8080 mode of control.
STM32_TFT_8bit::STM32_TFT_8bit(void) : Adafruit_GFX(TFTWIDTH, TFTHEIGHT)
{
	//Set PB3 - PB7 as output
	//Note: CRH and CRL are both 32 bits wide
	//Each pin is represented by 5 bits 0x3 (hex) sets that pin to O/P
	TFT_CNTRL->CRL = (TFT_CNTRL->CRL & 0x00000FFF) | 0x33333000;
	CS_IDLE; // Disable CS
//	CD_DATA; // Enable Command
	WR_IDLE; // Disable WR
	RD_IDLE; // Disable RD

	// toggle RST low to reset
	RST_IDLE;	 // Set Reset HIGH
	delay(5);
	RST_ACTIVE; // Set Reset LOW
	delay(20);
	RST_IDLE;	 // Set Reset HIGH
	delay(150);
}

void STM32_TFT_8bit::setWriteDataBus(void)
{
	// set the pins to output mode
	// not required to mask and assign, because all pins of bus are set together
	TFT_DATA->CRL = 0x33333333;
	//each pin is configured by four bits, and 0b0011 or 0x3 means output mode (same as pinmode())
}

void STM32_TFT_8bit::setReadDataBus(void)
{
	//set the pins to input mode
	// not required to mask and assign, because all pins of bus are set together
	TFT_DATA->CRL = 0x88888888;
	//8 in hex is 0b1000, which means input, same as pinmode()
	// for (uint8_t i = 0; i <= 7; i++){
	//	 pinMode(DPINS[i], INPUT);
	// }
}

void STM32_TFT_8bit::write8(uint8_t c)
{
	//BRR or BSRR avoid read, mask write cycle time
	//BSRR is 32 bits wide. 1's in the most significant 16 bits signify pins to reset (clear)
	// 1's in least significant 16 bits signify pins to set high. 0's mean 'do nothing'
	TFT_DATA->BSRR = ((~c)<<16) | (c); //Set pins to the 8 bit number
	//TFT_DATA->ODR = ((TFT_DATA->ODR & 0xFF00) | ((c) & 0x00FF));//FF00 is Binary 1111111100000000
	WR_STROBE;
	//delayMicroseconds(50); //used to observe patterns
}

void STM32_TFT_8bit::writeCmdByte(uint8_t c)
{
	CD_COMMAND;
	CS_ACTIVE;
	write8(c);
	CS_IDLE;
}

void STM32_TFT_8bit::writeCmdWord(uint16_t c)
{
	CD_COMMAND;
	CS_ACTIVE;
	write8(c >> 8);
	write8(c & 0xff);
	CS_IDLE;
}

void STM32_TFT_8bit::WriteCmd(uint16_t c)
{
//	if (_lcd_cmdWidth == 8) writeCmdByte(c & 0xff);
//	if (_lcd_cmdWidth == 16) writeCmdWord(c);
	if (_lcd_capable & MIPI_DCS_REV1) {
		writeCmdByte(c & 0xff);
	} else {
		writeCmdWord(c);
	}
}

void STM32_TFT_8bit::writeDataByte(uint8_t c)
{
	CD_DATA;
	CS_ACTIVE;
	write8(c);
	CS_IDLE;
}

void STM32_TFT_8bit::writeDataWord(uint16_t c)
{
	CD_DATA;
	CS_ACTIVE;
	write8(c >> 8);
	write8(c & 0xff);
	CS_IDLE;
}

void STM32_TFT_8bit::WriteCmdData(uint16_t cmd, uint16_t dat)
{
	WriteCmd(cmd);
	writeDataWord(dat);
}

void STM32_TFT_8bit::WriteCmdParamN(uint8_t cmd, int8_t N, uint8_t * block)
{
	writeCmdByte(cmd);
	while(N-- > 0) {
		uint8_t u8 = *block++;
		writeDataByte(u8);
	}
}

void STM32_TFT_8bit::WriteCmdParam4(uint8_t cmd, uint8_t d1, uint8_t d2, uint8_t d3, uint8_t d4)
{
	uint8_t d[4];
	d[0] = d1, d[1] = d2, d[2] = d3, d[3] = d4;
	WriteCmdParamN(cmd, 4, d);
}

#define TFTLCD_DELAY					0xFFFF
#define TFTLCD_DELAY8					0x7F

void STM32_TFT_8bit::init_table(const void *table, int16_t size)
{
	uint8_t *p = (uint8_t *) table, dat[24];						//R61526 has GAMMA[22] 
	while (size > 0) {
		uint8_t cmd = pgm_read_byte(p++);
		uint8_t len = pgm_read_byte(p++);
		if (cmd == TFTLCD_DELAY8) {
			delay(len);
			len = 0;
		} else {
			for (uint8_t i = 0; i < len; i++) {
				dat[i] = pgm_read_byte(p++);
			}
			WriteCmdParamN(cmd, len, dat);
		}
		size -= len + 2;
	}
}

void STM32_TFT_8bit::init_table16(const void *table, int16_t size)
{
	uint16_t *p = (uint16_t *) table;
	while (size > 0) {
		uint16_t cmd = pgm_read_word(p++);
		uint16_t d = pgm_read_word(p++);
		if (cmd == TFTLCD_DELAY) {
			delay(d);
		} else {
			writeCmdWord(cmd);
			writeDataWord(d);
		}
		size -= 2 * sizeof(int16_t);
	}
}

void STM32_TFT_8bit::setResolution(int16_t width, int16_t height)
{
	_lcd_width = width;
	_lcd_height = height;
}

void STM32_TFT_8bit::setOffset(int16_t offset)
{
	_lcd_offset = offset;
}

// Rather than a bazillion writeCmdByte() and writeDataByte() calls, screen
// initialization commands and arguments are organized in these tables
// stored in PROGMEM.	The table may look bulky, but that's mostly the
// formatting -- storage-wise this is hundreds of bytes more compact
// than the equivalent code.	Companion function follows.

//void STM32_TFT_8bit::begin(void) {
void STM32_TFT_8bit::begin(uint16_t ID)
{
	int16_t *p16;							 //so we can "write" to a const protected variable.
	const uint8_t *table8_ads = NULL;
	int16_t table_size;

	//set up 8 bit parallel port to write mode.
	setWriteDataBus();

	_lcd_ID = ID;
	switch (_lcd_ID) {
	case 0x1505:								//R61505 thanks Ravi_kanchan2004. R61505V, R61505W different
	case 0x9320:								//ILI9320
		_lcd_capable = 0 | REV_SCREEN | READ_BGR;
// common_9320:
		static const uint16_t ILI9320_regValues[] PROGMEM = {
				0x00e5, 0x8000,
				0x0000, 0x0001,
				0x0001, 0x100,
				0x0002, 0x0700,
				0x0003, 0x1030,
				0x0004, 0x0000,
				0x0008, 0x0202,
				0x0009, 0x0000,
				0x000A, 0x0000,
				0x000C, 0x0000,
				0x000D, 0x0000,
				0x000F, 0x0000,
				//-----Power On sequence-----------------------
				0x0010, 0x0000,
				0x0011, 0x0007,
				0x0012, 0x0000,
				0x0013, 0x0000,
				TFTLCD_DELAY, 50,
				0x0010, 0x17B0,	//SAP=1, BT=7, APE=1, AP=3
				0x0011, 0x0007,	//DC1=0, DC0=0, VC=7
				TFTLCD_DELAY, 10,
				0x0012, 0x013A,	//VCMR=1, PON=3, VRH=10
				TFTLCD_DELAY, 10,
				0x0013, 0x1A00,	//VDV=26
				0x0029, 0x000c,	//VCM=12
				TFTLCD_DELAY, 10,
				//-----Gamma control-----------------------
				0x0030, 0x0000,
				0x0031, 0x0505,
				0x0032, 0x0004,
				0x0035, 0x0006,
				0x0036, 0x0707,
				0x0037, 0x0105,
				0x0038, 0x0002,
				0x0039, 0x0707,
				0x003C, 0x0704,
				0x003D, 0x0807,
				//-----Set RAM area-----------------------
				0x0060, 0xA700,		 //GS=1
				0x0061, 0x0001,
				0x006A, 0x0000,
				0x0021, 0x0000,
				0x0020, 0x0000,
				//-----Partial Display Control------------
				0x0080, 0x0000,
				0x0081, 0x0000,
				0x0082, 0x0000,
				0x0083, 0x0000,
				0x0084, 0x0000,
				0x0085, 0x0000,
				//-----Panel Control----------------------
				0x0090, 0x0010,
				0x0092, 0x0000,
				0x0093, 0x0003,
				0x0095, 0x0110,
				0x0097, 0x0000,
				0x0098, 0x0000,
				//-----Display on-----------------------
				0x0007, 0x0173,
				TFTLCD_DELAY, 50,
		};
		init_table16(ILI9320_regValues, sizeof(ILI9320_regValues));
		break;

	case 0x5408:								//SPFD5408
//		_lcd_capable = 0 | REV_SCREEN | READ_BGR | INVERT_GS;
//		goto common_9320;
		_lcd_capable = 0 | REV_SCREEN | READ_BGR;
		goto common_93x5;

	case 0x9325:								//ILI9325
		_lcd_capable = 0 | REV_SCREEN | INVERT_GS;
		goto common_93x5;

	case 0x9331:								//ILI9331
	case 0x9335:								//ILI9335
		_lcd_capable = 0 | REV_SCREEN;
common_93x5:
		static const uint16_t ILI9325_regValues[] PROGMEM = {
				0x00E5, 0x78F0,		 // set SRAM internal timing
				0x0001, 0x0100,		 // set Driver Output Control
				0x0002, 0x0200,		 // set 1 line inversion
				0x0003, 0x1030,		 // set GRAM write direction and BGR=1.
				0x0004, 0x0000,		 // Resize register
				0x0005, 0x0000,		 // .kbv 16bits Data Format Selection
				0x0008, 0x0207,		 // set the back porch and front porch
				0x0009, 0x0000,		 // set non-display area refresh cycle ISC[3:0]
				0x000A, 0x0000,		 // FMARK function
				0x000C, 0x0000,		 // RGB interface setting
				0x000D, 0x0000,		 // Frame marker Position
				0x000F, 0x0000,		 // RGB interface polarity
				// ----------- Power On sequence ----------- //
				0x0010, 0x0000,		 // SAP, BT[3:0], AP, DSTB, SLP, STB
				0x0011, 0x0007,		 // DC1[2:0], DC0[2:0], VC[2:0]
				0x0012, 0x0000,		 // VREG1OUT voltage
				0x0013, 0x0000,		 // VDV[4:0] for VCOM amplitude
				0x0007, 0x0001,
				TFTLCD_DELAY, 200,	// Dis-charge capacitor power voltage
				0x0010, 0x1690,		 // SAP=1, BT=6, APE=1, AP=1, DSTB=0, SLP=0, STB=0
				0x0011, 0x0227,		 // DC1=2, DC0=2, VC=7
				TFTLCD_DELAY, 50,	 // wait_ms 50ms
				0x0012, 0x000D,		 // VCIRE=1, PON=0, VRH=5
				TFTLCD_DELAY, 50,	 // wait_ms 50ms
				0x0013, 0x1200,		 // VDV=28 for VCOM amplitude
				0x0029, 0x000A,		 // VCM=10 for VCOMH
				0x002B, 0x000D,		 // Set Frame Rate
				TFTLCD_DELAY, 50,	 // wait_ms 50ms
				0x0020, 0x0000,		 // GRAM horizontal Address
				0x0021, 0x0000,		 // GRAM Vertical Address
				// ----------- Adjust the Gamma Curve ----------//
				0x0030, 0x0000,
				0x0031, 0x0404,
				0x0032, 0x0003,
				0x0035, 0x0405,
				0x0036, 0x0808,
				0x0037, 0x0407,
				0x0038, 0x0303,
				0x0039, 0x0707,
				0x003C, 0x0504,
				0x003D, 0x0808,
				//------------------ Set GRAM area ---------------//
				0x0060, 0x2700,		 // Gate Scan Line GS=0 [0xA700] 
				0x0061, 0x0001,		 // NDL,VLE, REV .kbv
				0x006A, 0x0000,		 // set scrolling line
				//-------------- Partial Display Control ---------//
				0x0080, 0x0000,
				0x0081, 0x0000,
				0x0082, 0x0000,
				0x0083, 0x0000,
				0x0084, 0x0000,
				0x0085, 0x0000,
				//-------------- Panel Control -------------------//
				0x0090, 0x0010,
				0x0092, 0x0000,
				0x0007, 0x0133,		 // 262K color and display ON
		};
		init_table16(ILI9325_regValues, sizeof(ILI9325_regValues));
		break;

	case 0xB505:								//R61505V
	case 0xC505:								//R61505W
		_lcd_capable = 0 | REV_SCREEN | READ_LOWHIGH;
		static const uint16_t R61505V_regValues[] PROGMEM = {
				0x0000, 0x0000,
				0x0000, 0x0000,
				0x0000, 0x0000,
				0x0000, 0x0001,
				0x00A4, 0x0001,		 //CALB=1
				TFTLCD_DELAY, 10,
				0x0060, 0x2700,		 //NL
				0x0008, 0x0808,		 //FP & BP
				0x0030, 0x0214,		 //Gamma settings
				0x0031, 0x3715,
				0x0032, 0x0604,
				0x0033, 0x0E16,
				0x0034, 0x2211,
				0x0035, 0x1500,
				0x0036, 0x8507,
				0x0037, 0x1407,
				0x0038, 0x1403,
				0x0039, 0x0020,
				0x0090, 0x0015,		 //DIVI & RTNI
				0x0010, 0x0410,		 //BT=4,AP=1
				0x0011, 0x0237,		 //DC1=2,DC0=3, VC=7
				0x0029, 0x0046,		 //VCM1=70
				0x002A, 0x0046,		 //VCMSEL=0,VCM2=70
				// Sleep mode IN sequence
				0x0007, 0x0000,
				//0x0012, 0x0000,	 //PSON=0,PON=0
				// Sleep mode EXIT sequence 
				0x0012, 0x0189,		 //VCMR=1,PSON=0,PON=0,VRH=9
				0x0013, 0x1100,		 //VDV=17
				TFTLCD_DELAY, 150,
				0x0012, 0x01B9,		 //VCMR=1,PSON=1,PON=1,VRH=9 [018F]
				0x0001, 0x0100,		 //SS=1 Other mode settings
				0x0002, 0x0200,		 //BC0=1--Line inversion
				0x0003, 0x1030,
				0x0009, 0x0001,		 //ISC=1 [0000]
				0x000A, 0x0000,		 // [0000]
				//						0x000C, 0x0001,	 //RIM=1 [0000]
				0x000D, 0x0000,		 // [0000]
				0x000E, 0x0030,		 //VEM=3 VCOM equalize [0000]
				0x0061, 0x0001,
				0x006A, 0x0000,
				0x0080, 0x0000,
				0x0081, 0x0000,
				0x0082, 0x005F,
				0x0092, 0x0100,
				0x0093, 0x0701,
				TFTLCD_DELAY, 80,
				0x0007, 0x0100,		 //BASEE=1--Display On
		};
		init_table16(R61505V_regValues, sizeof(R61505V_regValues));
		break;

	case 0x7793:								//ST7793
	case 0xB509:								//R61509V
		_lcd_capable = REV_SCREEN;
		static const uint16_t R61509V_regValues[] PROGMEM = {
				0x0000, 0x0000,
				0x0000, 0x0000,
				0x0000, 0x0000,
				0x0000, 0x0000,
				TFTLCD_DELAY, 15,
				0x0400, 0x6200,		 //NL=0x31 (49) i.e. 400 rows
				0x0008, 0x0808,
				//gamma
				0x0300, 0x0C00,
				0x0301, 0x5A0B,
				0x0302, 0x0906,
				0x0303, 0x1017,
				0x0304, 0x2300,
				0x0305, 0x1700,
				0x0306, 0x6309,
				0x0307, 0x0C09,
				0x0308, 0x100C,
				0x0309, 0x2232,
				0x0010, 0x0016,		 //69.5Hz				 0016
				0x0011, 0x0101,
				0x0012, 0x0000,
				0x0013, 0x0001,
				0x0100, 0x0330,		 //BT,AP
				0x0101, 0x0237,		 //DC0,DC1,VC
				0x0103, 0x0D00,		 //VDV
				0x0280, 0x6100,		 //VCM
				0x0102, 0xC1B0,		 //VRH,VCMR,PSON,PON
				TFTLCD_DELAY, 50,
				0x0001, 0x0100,
				0x0002, 0x0100,
				0x0003, 0x1030,		 //1030
				0x0009, 0x0001,
				0x000C, 0x0000,
				0x0090, 0x8000,
				0x000F, 0x0000,
				0x0210, 0x0000,
				0x0211, 0x00EF,
				0x0212, 0x0000,
				0x0213, 0x018F,		 //432=01AF,400=018F
				0x0500, 0x0000,
				0x0501, 0x0000,
				0x0502, 0x005F,		 //???
				0x0401, 0x0001,		 //REV=1
				0x0404, 0x0000,
				TFTLCD_DELAY, 50,
				0x0007, 0x0100,		 //BASEE
				TFTLCD_DELAY, 50,
				0x0200, 0x0000,
				0x0201, 0x0000,
		};
		init_table16(R61509V_regValues, sizeof(R61509V_regValues));
		break;

	case 0x4532:		// thanks Leodino
		_lcd_capable = 0 | REV_SCREEN;	// | INVERT_GS;
		static const uint16_t LGDP4532_regValues[] PROGMEM = {
		0x0000,0x0001, //Device code read
		0x0010,0x0628, //Power control 1 SAP[2:0] BT[3:0] AP[2:0] DK DSTB SLP
		0x0012,0x0006, //Power control 3 PON VRH[3:0]
		//0x0013,0x0A32, //Power control 4 VCOMG VDV[4:0] VCM[6:0]
		0x0011,0x0040, //Power control 2; DC1[2:0] DC0[2:0] VC[2:0]
		//0x0015,0x0050, //Regulator control RSET RI[2:0] RV[2:0] RCONT[2:0]
		0x0012,0x0016, //Power control 3 PON VRH[3:0]
		TFTLCD_DELAY,50,
		0x0010,0x5660, //Power control 1 SAP[2:0] BT[3:0] AP[2:0] DK DSTB SLP
		TFTLCD_DELAY,50,
		//0x0013,0x2A4E, //Power control 4 VCOMG VDV[4:0] VCM[6:0]
		//0x0001,0x0100, //Driver output control SM SS
		//0x0002,0x0300, //LCD Driving Wave Control
		//0x0003,0x1030, //Entry mode TRI DFM	BGR	ORG I/D[1:0] AM
		//0x0007,0x0202, //Display Control 1 PTDE[1:0] BASEE GON DTE COL D[1:0]
		TFTLCD_DELAY,50,
		//0x0008,0x0202, //Display Control 2 FP[3:0] BP[3:0] front and back porch (blank period at begin and end..)
		//0x000A,0x0000, //Test Register 1 (RA0h)
		//Gamma adjustment
		0x0030,0x0000,
		0x0031,0x0402,
		0x0032,0x0106,
		0x0033,0x0700,
		0x0034,0x0104,
		0x0035,0x0301,
		0x0036,0x0707,
		0x0037,0x0305,
		0x0038,0x0208,
		0x0039,0x0F0B,
		TFTLCD_DELAY,50,
		//some of this stuff in range 41-93 really throws things off....
		//0x0041,0x0002,
		//0x0060,0x2700, //Driver Output Control (R60h)
		//0x0061,0x0001, //Base Image Display Control (R61h)
		//0x0090,0x0119,	 //Panel Interface Control 1 (R90h) DIVI[1:0]	RTNI[4:0]
		//0x0092,0x010A,	//Panel Interface Control 2 (R92h)	NOWI[2:0] EQI2[1:0] EQI1[1:0]
		//0x0093,0x0004, //Panel Interface Control 3 (R93h) MCPI[2:0]
		//0x00A0,0x0100, //Test Register 1 (RA0h)
		TFTLCD_DELAY,50,
		0x0007,0x0133, //Display Control 1 PTDE[1:0] BASEE GON DTE COL D[1:0]
		TFTLCD_DELAY,50,
		//0x00A0,0x0000, //Test Register 1 (RA0h)
		};
		init_table16(LGDP4532_regValues, sizeof(LGDP4532_regValues));
		break;

	case 0x4535:
		_lcd_capable = 0 | REV_SCREEN;	// | INVERT_GS;
		static const uint16_t LGDP4535_regValues[] PROGMEM = {
				0x0015, 0x0030,		 // Set the internal vcore voltage																							 
				0x009A, 0x0010,		 // Start internal OSC 
				0x0011, 0x0020,		 // set SS and SM bit 
				0x0010, 0x3428,		 // set 1 line inversion 
				0x0012, 0x0002,		 // set GRAM write direction and BGR=1	
				0x0013, 0x1038,		 // Resize register 
				TFTLCD_DELAY, 40,
				0x0012, 0x0012,		 // set the back porch and front porch 
				TFTLCD_DELAY, 40,
				0x0010, 0x3420,		 // set non-display area refresh cycle ISC[3:0] 
				0x0013, 0x3045,		 // FMARK function 
				TFTLCD_DELAY, 70,
				0x0030, 0x0000,		 // RGB interface setting 
				0x0031, 0x0402,		 // Frame marker Position 
				0x0032, 0x0307,		 // RGB interface polarity 
				0x0033, 0x0304,		 // SAP, BT[3:0], AP, DSTB, SLP, STB 
				0x0034, 0x0004,		 // DC1[2:0], DC0[2:0], VC[2:0] 
				0x0035, 0x0401,		 // VREG1OUT voltage 
				0x0036, 0x0707,		 // VDV[4:0] for VCOM amplitude 
				0x0037, 0x0305,		 // SAP, BT[3:0], AP, DSTB, SLP, STB 
				0x0038, 0x0610,		 // DC1[2:0], DC0[2:0], VC[2:0] 
				0x0039, 0x0610,		 // VREG1OUT voltage 
				0x0001, 0x0100,		 // VDV[4:0] for VCOM amplitude 
				0x0002, 0x0300,		 // VCM[4:0] for VCOMH 
				0x0003, 0x1030,		 // GRAM horizontal Address 
				0x0008, 0x0808,		 // GRAM Vertical Address 
				0x000A, 0x0008,
				0x0060, 0x2700,		 // Gate Scan Line 
				0x0061, 0x0001,		 // NDL,VLE, REV 
				0x0090, 0x013E,
				0x0092, 0x0100,
				0x0093, 0x0100,
				0x00A0, 0x3000,
				0x00A3, 0x0010,
				0x0007, 0x0001,
				0x0007, 0x0021,
				0x0007, 0x0023,
				0x0007, 0x0033,
				0x0007, 0x0133,
		};
		init_table16(LGDP4535_regValues, sizeof(LGDP4535_regValues));
		break;

	case 0x9341:								//ILI9341
		_lcd_capable = AUTO_READINC | MIPI_DCS_REV1 | MV_AXIS | READ_24BITS;
		static const uint8_t ILI9341_regValues_2_4[] PROGMEM = {				// BOE 2.4"
				0xF6, 3, 0x01, 0x01, 0x00,	//Interface Control needs EXTC=1 MV_EOR=0, TM=0, RIM=0
				0xCF, 3, 0x00, 0x81, 0x30,	//Power Control B [00 81 30]
				0xED, 4, 0x64, 0x03, 0x12, 0x81,		//Power On Seq [55 01 23 01]
				0xE8, 3, 0x85, 0x10, 0x78,	//Driver Timing A [04 11 7A]
				0xCB, 5, 0x39, 0x2C, 0x00, 0x34, 0x02,			//Power Control A [39 2C 00 34 02]
				0xF7, 1, 0x20,			//Pump Ratio [10]
				0xEA, 2, 0x00, 0x00,				//Driver Timing B [66 00]
				0xB0, 1, 0x00,			//RGB Signal [00] 
				0xB1, 2, 0x00, 0x1B,				//Frame Control [00 1B]
				//0xB6, 2, 0x0A, 0xA2, 0x27, //Display Function [0A 82 27 XX]		.kbv SS=1	
				0xB4, 1, 0x00,			//Inversion Control [02] .kbv NLA=1, NLB=1, NLC=1
				0xC0, 1, 0x21,			//Power Control 1 [26]
				0xC1, 1, 0x11,			//Power Control 2 [00]
				0xC5, 2, 0x3F, 0x3C,				//VCOM 1 [31 3C]
				0xC7, 1, 0xB5,			//VCOM 2 [C0]
				0x36, 1, 0x48,			//Memory Access [00]
				0xF2, 1, 0x00,			//Enable 3G [02]
				0x26, 1, 0x01,			//Gamma Set [01]
				0xE0, 15, 0x0f, 0x26, 0x24, 0x0b, 0x0e, 0x09, 0x54, 0xa8, 0x46, 0x0c, 0x17, 0x09, 0x0f, 0x07, 0x00,
				0xE1, 15, 0x00, 0x19, 0x1b, 0x04, 0x10, 0x07, 0x2a, 0x47, 0x39, 0x03, 0x06, 0x06, 0x30, 0x38, 0x0f,
			};
		table8_ads = ILI9341_regValues_2_4, table_size = sizeof(ILI9341_regValues_2_4);	 //
		break;

