leandroschwarz/funsapeLib/_stuff/loose_files/(DEVICE)[CHECK]tftDisplay/STM32_TFT_8bit (2).cpp
	case 0x9342:								//ILI9342
		_lcd_capable = AUTO_READINC | MIPI_DCS_REV1 | MV_AXIS | READ_24BITS | INVERT_GS | REV_SCREEN;
		static const uint8_t ILI9342_regValues_CPT24[] PROGMEM = {		 //CPT 2.4"
			(0xB9), 3, 0xFF, 0x93, 0x42, //[00 00 00]
			(0xC0), 2, 0x1D, 0x0A,		//[26 09]
			(0xC1), 1, 0x02,					//[10]
			(0xC5), 2, 0x2F, 0x2F,		//[31 3C]
			(0xC7), 1, 0xC3,					//[C0]
			(0xB8), 1, 0x0B,					//[07]
			(0xE0), 15, 0x0F, 0x33, 0x30, 0x0C, 0x0F, 0x08, 0x5D, 0x66, 0x4A, 0x07, 0x13, 0x05, 0x1B, 0x0E, 0x08,
			(0xE1), 15, 0x08, 0x0E, 0x11, 0x02, 0x0E, 0x02, 0x24, 0x33, 0x37, 0x03, 0x0A, 0x09, 0x26, 0x33, 0x0F,
		};
		static const uint8_t ILI9342_regValues_Tianma23[] PROGMEM = {		 //Tianma 2.3"
			(0xB9), 3, 0xFF, 0x93, 0x42,
			(0xC0), 2, 0x1D, 0x0A,
			(0xC1), 1, 0x01,
			(0xC5), 2, 0x2C, 0x2C,
			(0xC7), 1, 0xC6,
			(0xB8), 1, 0x09,
			(0xE0), 15, 0x0F, 0x26, 0x21, 0x07, 0x0A, 0x03, 0x4E, 0x62, 0x3E, 0x0B, 0x11, 0x00, 0x08, 0x02, 0x00,
			(0xE1), 15, 0x00, 0x19, 0x1E, 0x03, 0x0E, 0x03, 0x30, 0x23, 0x41, 0x03, 0x0B, 0x07, 0x2F, 0x36, 0x0F,
		};
		static const uint8_t ILI9342_regValues_HSD23[] PROGMEM = {		 //HSD 2.3"
			(0xB9), 3, 0xFF, 0x93, 0x42,
			(0xC0), 2, 0x1D, 0x0A,
			(0xC1), 1, 0x02,
			(0xC5), 2, 0x2F, 0x27,
			(0xC7), 1, 0xA4,
			(0xB8), 1, 0x0B,
			(0xE0), 15, 0x0F, 0x24, 0x21, 0x0C, 0x0F, 0x06, 0x50, 0x75, 0x3F, 0x07, 0x12, 0x05, 0x11, 0x0B, 0x08,
			(0xE1), 15, 0x08, 0x1D, 0x20, 0x02, 0x0E, 0x04, 0x31, 0x24, 0x42, 0x03, 0x0B, 0x09, 0x30, 0x36, 0x0F,
		};
		table8_ads = ILI9342_regValues_CPT24, table_size = sizeof(ILI9342_regValues_CPT24);	 //
		//table8_ads = ILI9342_regValues_Tianma23, table_size = sizeof(ILI9342_regValues_Tianma23);	 //
		//table8_ads = ILI9342_regValues_HSD23, table_size = sizeof(ILI9342_regValues_HSD23);	 //
		p16 = (int16_t *) & HEIGHT;
		*p16 = 240;
		p16 = (int16_t *) & WIDTH;
		*p16 = 320;
		break;

	case 0x1581:												//no BGR in MADCTL.	set BGR in Panel Control
		_lcd_capable = AUTO_READINC | MIPI_DCS_REV1 | MV_AXIS | READ_24BITS; //thanks zdravke
		goto common_9481;

	case 0x9481:								//ILI9481
		_lcd_capable = AUTO_READINC | MIPI_DCS_REV1 | MV_AXIS | READ_BGR;
common_9481:
		static const uint8_t ILI9481_regValues[] PROGMEM = {		// Atmel MaxTouch
				0xB0, 1, 0x00,							// unlocks E0, F0
				0xB3, 4, 0x02, 0x00, 0x00, 0x00, //Frame Memory, interface [02 00 00 00]
				0xB4, 1, 0x00,							// Frame mode [00]
				0xD0, 3, 0x07, 0x42, 0x18,	// Set Power [00 43 18] x1.00, x6, x3
				0xD1, 3, 0x00, 0x07, 0x10,	// Set VCOM	[00 00 00] x0.72, x1.02
				0xD2, 2, 0x01, 0x02,				// Set Power for Normal Mode [01 22]
				0xD3, 2, 0x01, 0x02,				// Set Power for Partial Mode [01 22]
				0xD4, 2, 0x01, 0x02,				// Set Power for Idle Mode [01 22]
				0xC0, 5, 0x12, 0x3B, 0x00, 0x02, 0x11, //Panel Driving BGR for 1581 [10 3B 00 02 11]
				0xC1, 3, 0x10, 0x10, 0x88,	// Display Timing Normal [10 10 88]
				0xC5, 1, 0x03,			//Frame Rate [03]
				0xC6, 1, 0x02,			//Interface Control [02]
				0xC8, 12, 0x00, 0x32, 0x36, 0x45, 0x06, 0x16, 0x37, 0x75, 0x77, 0x54, 0x0C, 0x00,
				0xCC, 1, 0x00,			//Panel Control [00]
		};
		static const uint8_t ILI9481_CPT29_regValues[] PROGMEM = {		// 320x430
				0xB0, 1, 0x00,
				0xD0, 3, 0x07, 0x42, 0x1C,	// Set Power [00 43 18]
				0xD1, 3, 0x00, 0x02, 0x0F,	// Set VCOM	[00 00 00] x0.695, x1.00
				0xD2, 2, 0x01, 0x11,				// Set Power for Normal Mode [01 22]
				0xC0, 5, 0x10, 0x35, 0x00, 0x02, 0x11,			//Set Panel Driving [10 3B 00 02 11]
				0xC5, 1, 0x03,			//Frame Rate [03]
				0xC8, 12, 0x00, 0x30, 0x36, 0x45, 0x04, 0x16, 0x37, 0x75, 0x77, 0x54, 0x0F, 0x00,
				0xE4, 1, 0xA0,
				0xF0, 1, 0x01,
				0xF3, 2, 0x02, 0x1A,			
		};
		static const uint8_t ILI9481_PVI35_regValues[] PROGMEM = {		// 320x480
				0xB0, 1, 0x00,
				0xD0, 3, 0x07, 0x41, 0x1D,	// Set Power [00 43 18]
				0xD1, 3, 0x00, 0x2B, 0x1F,	// Set VCOM	[00 00 00] x0.900, x1.32
				0xD2, 2, 0x01, 0x11,				// Set Power for Normal Mode [01 22]
				0xC0, 5, 0x10, 0x3B, 0x00, 0x02, 0x11,			//Set Panel Driving [10 3B 00 02 11]
				0xC5, 1, 0x03,			//Frame Rate [03]
				0xC8, 12, 0x00, 0x14, 0x33, 0x10, 0x00, 0x16, 0x44, 0x36, 0x77, 0x00, 0x0F, 0x00,
				0xE4, 1, 0xA0,
				0xF0, 1, 0x01,
				0xF3, 2, 0x40, 0x0A,			
		};
		static const uint8_t ILI9481_AUO317_regValues[] PROGMEM = {		// 320x480
				0xB0, 1, 0x00,
				0xD0, 3, 0x07, 0x40, 0x1D,	// Set Power [00 43 18]
				0xD1, 3, 0x00, 0x18, 0x13,	// Set VCOM	[00 00 00] x0.805, x1.08
				0xD2, 2, 0x01, 0x11,				// Set Power for Normal Mode [01 22]
				0xC0, 5, 0x10, 0x3B, 0x00, 0x02, 0x11,			//Set Panel Driving [10 3B 00 02 11]
				0xC5, 1, 0x03,			//Frame Rate [03]
				0xC8, 12, 0x00, 0x44, 0x06, 0x44, 0x0A, 0x08, 0x17, 0x33, 0x77, 0x44, 0x08, 0x0C,
				0xE4, 1, 0xA0,
				0xF0, 1, 0x01,			
		};
		static const uint8_t ILI9481_CMO35_regValues[] PROGMEM = {		// 320480
				0xB0, 1, 0x00,
				0xD0, 3, 0x07, 0x41, 0x1D,	// Set Power [00 43 18] 07,41,1D
				0xD1, 3, 0x00, 0x1C, 0x1F,	// Set VCOM	[00 00 00] x0.825, x1.32 1C,1F
				0xD2, 2, 0x01, 0x11,				// Set Power for Normal Mode [01 22]
				0xC0, 5, 0x10, 0x3B, 0x00, 0x02, 0x11,			//Set Panel Driving [10 3B 00 02 11]
				0xC5, 1, 0x03,			//Frame Rate [03]
				0xC6, 1, 0x83, 
				0xC8, 12, 0x00, 0x26, 0x21, 0x00, 0x00, 0x1F, 0x65, 0x23, 0x77, 0x00, 0x0F, 0x00,
				0xF0, 1, 0x01,		//?
				0xE4, 1, 0xA0,			//?SETCABC on Himax
				0x36, 1, 0x48,			//Memory Access [00]
				0xB4, 1, 0x11,			
		};
		static const uint8_t ILI9481_RGB_regValues[] PROGMEM = {		// 320x480
				0xB0, 1, 0x00,
				0xD0, 3, 0x07, 0x41, 0x1D,	// SETPOWER [00 43 18]
				0xD1, 3, 0x00, 0x2B, 0x1F,	// SETVCOM	[00 00 00] x0.900, x1.32
				0xD2, 2, 0x01, 0x11,				// SETNORPOW for Normal Mode [01 22]
				0xC0, 6, 0x10, 0x3B, 0x00, 0x02, 0x11, 0x00,		 //SETPANEL [10 3B 00 02 11]
				0xC5, 1, 0x03,			//SETOSC Frame Rate [03]
				0xC6, 1, 0x80,			//SETRGB interface control
				0xC8, 12, 0x00, 0x14, 0x33, 0x10, 0x00, 0x16, 0x44, 0x36, 0x77, 0x00, 0x0F, 0x00,
				0xF3, 2, 0x40, 0x0A,			
				0xF0, 1, 0x08,
				0xF6, 1, 0x84,
				0xF7, 1, 0x80,
				0x0C, 2, 0x00, 0x55, //RDCOLMOD
				0xB4, 1, 0x00,			//SETDISPLAY
//				0xB3, 4, 0x00, 0x01, 0x06, 0x01,	//SETGRAM simple example
				0xB3, 4, 0x00, 0x01, 0x06, 0x30,	//jpegs example
		};
		table8_ads = ILI9481_regValues, table_size = sizeof(ILI9481_regValues);
//		table8_ads = ILI9481_CPT29_regValues, table_size = sizeof(ILI9481_CPT29_regValues);
//		table8_ads = ILI9481_PVI35_regValues, table_size = sizeof(ILI9481_PVI35_regValues);
//		table8_ads = ILI9481_AUO317_regValues, table_size = sizeof(ILI9481_AUO317_regValues);
//		table8_ads = ILI9481_CMO35_regValues, table_size = sizeof(ILI9481_CMO35_regValues);
//		table8_ads = ILI9481_RGB_regValues, table_size = sizeof(ILI9481_RGB_regValues);
		break;

	case 0x6814:
		_lcd_capable = AUTO_READINC | MIPI_DCS_REV1 | MV_AXIS;
		static const uint8_t RM68140_regValues_max[] PROGMEM = {				//
				0x3A, 1, 0x55,			//Pixel format .kbv my Mega Shield
		};
		table8_ads = RM68140_regValues_max, table_size = sizeof(RM68140_regValues_max);
		break;

	case 0x7783:
		_lcd_capable = AUTO_READINC | REV_SCREEN | INVERT_GS;
		static const uint16_t ST7781_regValues[] PROGMEM = {
				0x00FF, 0x0001,		 //can we do 0xFF
				0x00F3, 0x0008,
				//	LCD_Write_COM(0x00F3,
				0x00, 0x0001,
				0x0001, 0x0100,		 // Driver Output Control Register (R01h)
				0x0002, 0x0700,		 // LCD Driving Waveform Control (R02h)
				0x0003, 0x1030,		 // Entry Mode (R03h)
				0x0008, 0x0302,
				0x0009, 0x0000,
				0x0010, 0x0000,		 // Power Control 1 (R10h)
				0x0011, 0x0007,		 // Power Control 2 (R11h)
				0x0012, 0x0000,		 // Power Control 3 (R12h)
				0x0013, 0x0000,		 // Power Control 4 (R13h)
				TFTLCD_DELAY, 50,
				0x0010, 0x14B0,		 // Power Control 1 SAP=1, BT=4, APE=1, AP=3
				TFTLCD_DELAY, 10,
				0x0011, 0x0007,		 // Power Control 2 VC=7
				TFTLCD_DELAY, 10,
				0x0012, 0x008E,		 // Power Control 3 VCIRE=1, VRH=14
				0x0013, 0x0C00,		 // Power Control 4 VDV=12
				0x0029, 0x0015,		 // NVM read data 2 VCM=21
				TFTLCD_DELAY, 10,
				0x0030, 0x0000,		 // Gamma Control 1
				0x0031, 0x0107,		 // Gamma Control 2
				0x0032, 0x0000,		 // Gamma Control 3
				0x0035, 0x0203,		 // Gamma Control 6
				0x0036, 0x0402,		 // Gamma Control 7
				0x0037, 0x0000,		 // Gamma Control 8
				0x0038, 0x0207,		 // Gamma Control 9
				0x0039, 0x0000,		 // Gamma Control 10
				0x003C, 0x0203,		 // Gamma Control 13
				0x003D, 0x0403,		 // Gamma Control 14
				0x0060, 0xA700,		 // Driver Output Control (R60h) .kbv was 0xa700
				0x0061, 0x0001,		 // Driver Output Control (R61h)
				0x0090, 0X0029,		 // Panel Interface Control 1 (R90h)
				// Display On
				0x0007, 0x0133,		 // Display Control (R07h)
				TFTLCD_DELAY, 50,
		};
		init_table16(ST7781_regValues, sizeof(ST7781_regValues));
		break;
	}

	// Set screen resolution
	if (_lcd_width != 0 || _lcd_height !=0) {
		p16 = (int16_t *) & HEIGHT;
		*p16 = _lcd_height;
		p16 = (int16_t *) & WIDTH;
		*p16 = _lcd_width;
	}

	if (table8_ads != NULL) {
		static const uint8_t reset_off[] PROGMEM = {
			0x01, 0,						//Soft Reset
			TFTLCD_DELAY8, 150, // .kbv will power up with ONLY reset, sleep out, display on
			0x28, 0,						//Display Off
			0x3A, 1, 0x55,			//Pixel read=565, write=565.
		};
		static const uint8_t wake_on[] PROGMEM = {
			0x11, 0,						//Sleep Out
			TFTLCD_DELAY8, 150,
			0x29, 0,						//Display On
		};
		init_table(&reset_off, sizeof(reset_off));
		init_table(table8_ads, table_size);	 //can change PIXFMT
		init_table(&wake_on, sizeof(wake_on));
	}
	setRotation(0);						 //PORTRAIT
	invertDisplay(false);
}

void STM32_TFT_8bit::drawPixel(int16_t x, int16_t y, uint16_t color)
{
	// MCUFRIEND just plots at edge if you try to write outside of the box:
	if (x < 0 || y < 0 || x >= width() || y >= height()){
		return;
	}
	if (_lcd_offset) {
		if (rotation == 2) {
			y += _lcd_offset;
		}
		if (rotation == 3) {
			x += _lcd_offset;
		}
	}
	if (_lcd_capable & MIPI_DCS_REV1) {
		WriteCmdParam4(_MC, x >> 8, x, x >> 8, x);
		WriteCmdParam4(_MP, y >> 8, y, y >> 8, y);
	} else {
		WriteCmdData(_MC, x);
		WriteCmdData(_MP, y);
	}
	WriteCmdData(_MW, color);
}

