leandroschwarz/funsapeLib/_stuff/loose_files/(DEVICE)[CHECK]tftDisplay/STM32_TFT_8bit (2).cpp
void STM32_TFT_8bit::setAddrWindow(uint16_t x, uint16_t y, uint16_t x1, uint16_t y1)
{
	if (_lcd_offset) {
		if (rotation == 2) {
			y += _lcd_offset;
			y1 += _lcd_offset;
		}
		if (rotation == 3) {
			x += _lcd_offset;
			x1 += _lcd_offset;
		}
	}

	if (_lcd_capable & MIPI_DCS_REV1) {
		WriteCmdParam4(_MC, x >> 8, x, x1 >> 8, x1);
		WriteCmdParam4(_MP, y >> 8, y, y1 >> 8, y1);
	} else {
		WriteCmdData(_MC, x);
		WriteCmdData(_MP, y);
		if (_lcd_capable & XSA_XEA_16BIT) {
			if (rotation & 1) {
				y1 = y = (y1 << 8) | y;
			} else {
				x1 = x = (x1 << 8) | x;
			}
		}
		WriteCmdData(_SC, x);
		WriteCmdData(_SP, y);
		WriteCmdData(_EC, x1);
		WriteCmdData(_EP, y1);
	}
//	WriteCmd(_MW); // write to RAM
}

void STM32_TFT_8bit::fillRect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color)
{
	int16_t end;
	if (w < 0) {
		w = -w;
		x -= w;
	}													 //+ve w
	end = x + w;
	if (x < 0) {
			x = 0;
	}
	if (end > width()) {
		end = width();
	}
	w = end - x;
	if (h < 0) {
			h = -h;
			y -= h;
	}													 //+ve h
	end = y + h;
	if (y < 0) {
			y = 0;
	}
	if (end > height()) {
		end = height();
	}
	h = end - y;

	setAddrWindow(x, y, x + w - 1, y + h - 1);
	WriteCmd(_MW);
	if (h > w) {
		end = h;
		h = w;
		w = end;
	}
	while (h-- > 0) {
		end = w;
		do {
			writeDataWord(color);
		} while (--end != 0);
	}
	if (!(_lcd_capable & MIPI_DCS_REV1) || ((_lcd_ID == 0x1526) && (rotation & 1))) {
		setAddrWindow(0, 0, width() - 1, height() - 1);
	}
}

void STM32_TFT_8bit::pushColors8(uint8_t * block, int16_t n, bool first)
{
	uint16_t color;
	uint8_t h, l;

	if (first) {
		WriteCmd(_MW);
	}
	while (n-- > 0) {
		h = (*block++);
		l = (*block++);
		color = h << 8 | l;
		writeDataWord(color);
	}
}

void STM32_TFT_8bit::pushColors(uint16_t * block, int16_t n, bool first)
{
	uint16_t color;
	uint8_t h, l;

	if (first) {
		WriteCmd(_MW);
	}
	while (n-- > 0) {
		color = (*block++);
		writeDataWord(color);
	}
}

void STM32_TFT_8bit::drawFastVLine(int16_t x, int16_t y, int16_t h, uint16_t color)
{
	// Rudimentary clipping
	if ((x >= _width) || (y >= _height || h < 1))
	{
		return;
	}
	if ((y + h - 1) >= _height) {
		h = _height - y;
	}
	fillRect(x, y, 1, h, color);
}

void STM32_TFT_8bit::drawFastHLine(int16_t x, int16_t y, int16_t w, uint16_t color)
{
	// Rudimentary clipping
	if ((x >= _width) || (y >= _height || w < 1)) {
		return;
	}
	if ((x + w - 1) >= _width) {
		w = _width - x;
	}
	fillRect(x, y, w, 1, color);
}

void STM32_TFT_8bit::fillScreen(uint16_t color)
{
	fillRect(0, 0, _width, _height, color);
}

/*
* Draw lines faster by calculating straight sections and drawing them with fastVline and fastHline.
*/
#if defined (__STM32F1__)
void STM32_TFT_8bit::drawLine(int16_t x1, int16_t y1, int16_t x2, int16_t y2, uint16_t color)
{
	int16_t i;
	int16_t dx,dy;
	int16_t sx,sy;
	int16_t E;
	
	/* distance between two points */
	dx = ( x2 > x1 ) ? x2 - x1 : x1 - x2;
	dy = ( y2 > y1 ) ? y2 - y1 : y1 - y2;

	/* direction of two point */
	sx = ( x2 > x1 ) ? 1 : -1;
	sy = ( y2 > y1 ) ? 1 : -1;

	if (y1 == y2) {
		if (x2 > x1) {
			drawFastHLine(x1, y1, x2 - x1 + 1, color);
		} else {
			drawFastHLine(x2, y1, x1 - x2 + 1, color);
		}
		return;
	} else if (x1 == x2) {
		if (y2 > y1) {
			drawFastVLine(x1, y1, y2 - y1 + 1, color);
		} else {
			drawFastVLine(x1, y2, y1 - y2 + 1, color);
		}
		return;
	}

	/* inclination < 1 */
	if (dx > dy) {
		E = -dx;
		for (i = 0;i <= dx;i++) {
			drawPixel(x1, y1, color);
			x1 += sx;
			E += 2 * dy;
			if (E >= 0) {
				y1 += sy;
				E -= 2 * dx;
			}
		}
	/* inclination >= 1 */
	} else {
		E = -dy;
		for ( i = 0 ; i <= dy ; i++ ) {
			drawPixel( x1, y1, color );
			y1 += sy;
			E += 2 * dx;
			if ( E >= 0 ) {
				x1 += sx;
				E -= 2 * dy;
			}
		}
	}
}
#endif

// Pass 8-bit (each) R,G,B, get back 16-bit packed color
uint16_t STM32_TFT_8bit::color565(uint8_t r, uint8_t g, uint8_t b)
{
	return ((r & 0xF8) << 8) | ((g & 0xFC) << 3) | (b >> 3);
}

// independent cursor and window registers.	 ILI9341/9342 auto increments.	ILI9320/9325 do not.
// VERY VERY SLOW !!
int16_t STM32_TFT_8bit::readGRAM(int16_t x, int16_t y, uint16_t * block, int16_t w, int16_t h)
{
	uint16_t ret, dummy, _MR = _MW;
	int16_t n = w * h, row = 0, col = 0;
	uint8_t r, g, b, tmp;
	if (!is8347 && _lcd_capable & MIPI_DCS_REV1) {		// HX8347 uses same register
		_MR = 0x2E;
	}
	setAddrWindow(x, y, x + w - 1, y + h - 1);
	while (n > 0) {
		if (!(_lcd_capable & MIPI_DCS_REV1)) {
				WriteCmdData(_MC, x + col);
				WriteCmdData(_MP, y + row);
		}
		WriteCmd(_MR);
		setReadDataBus();
		CS_ACTIVE;
		CD_DATA;
		if (_lcd_capable & READ_NODUMMY) {
			;
		} else if ((_lcd_capable & MIPI_DCS_REV1) || _lcd_ID == 0x1289) {
			r=read8();
		} else {
			dummy=read16bits();
		}
		if (_lcd_ID == 0x1511) {
			r=read8();	 //extra dummy for R61511
		}
		while (n) {
			if (_lcd_capable & READ_24BITS) {
				r=read8();
				g=read8();
				b=read8();
				if (_lcd_capable & READ_BGR) {
					ret = color565(b, g, r);
				} else {
					ret = color565(r, g, b);
				}
			} else {
				ret=read16bits();
				if (_lcd_capable & READ_LOWHIGH) {
					ret = (ret >> 8) | (ret << 8);
				}
				if (_lcd_capable & READ_BGR) {
					ret = (ret & 0x07E0) | (ret >> 11) | (ret << 11);
				}
			}
			*block++ = ret;
			n--;
			if (!(_lcd_capable & AUTO_READINC)) {
				break;
			}
		}
		if (++col >= w) {
			col = 0;
			if (++row >= h) {
					row = 0;
			}
		}
		RD_IDLE;
//		CS_IDLE;
		setWriteDataBus();
	}
	if (!(_lcd_capable & MIPI_DCS_REV1)) {
		setAddrWindow(0, 0, width() - 1, height() - 1);
	}
	return 0;
}

void STM32_TFT_8bit::setRotation(uint8_t r)
{
	uint16_t GS, SS, ORG, REV = _lcd_rev;
	uint8_t val, d[3];
	rotation = r & 3;					 // just perform the operation ourselves on the protected variables
	_width = (rotation & 1) ? HEIGHT : WIDTH;
	_height = (rotation & 1) ? WIDTH : HEIGHT;

	switch (rotation) {
	case 0:										//PORTRAIT:
		val = 0x48;							//MY=0, MX=1, MV=0, ML=0, BGR=1
		break;
	case 1:										//LANDSCAPE: 90 degrees
		val = 0x28;							//MY=0, MX=0, MV=1, ML=0, BGR=1
		break;
	case 2:										//PORTRAIT_REV: 180 degrees
		val = 0x98;							//MY=1, MX=0, MV=0, ML=1, BGR=1
		break;
	case 3:										//LANDSCAPE_REV: 270 degrees
		val = 0xF8;							//MY=1, MX=1, MV=1, ML=1, BGR=1
		break;
	}

	if (_lcd_capable & INVERT_GS) {
		val ^= 0x80;
	}
	if (_lcd_capable & INVERT_SS) {
		val ^= 0x40;
	}
	if (_lcd_capable & INVERT_RGB) {
		val ^= 0x08;
	}

	if (_lcd_capable & MIPI_DCS_REV1) {
		if (_lcd_ID == 0x6814) {	//.kbv my weird 0x9486 might be 68140
			GS = (val & 0x80) ? (1 << 6) : 0;	 //MY
			SS = (val & 0x40) ? (1 << 5) : 0;	 //MX
			val &= 0x28;				//keep MV, BGR, MY=0, MX=0, ML=0
			d[0] = 0;
			d[1] = GS | SS | 0x02;			//MY, MX
			d[2] = 0x3B;
			WriteCmdParamN(0xB6, 3, d);
			goto common_MC;
		} else if (_lcd_ID == 0x1963 || _lcd_ID == 0x9481 || _lcd_ID == 0x1511) {
			if (val & 0x80) {
				val |= 0x01;		//GS
			}
			if ((val & 0x40)) {
				val |= 0x02;		//SS
			}
			if (_lcd_ID == 0x1963) {
				val &= ~0xC0;
			}
			if (_lcd_ID == 0x9481) {
				val &= ~0xD0;
			}
			if (_lcd_ID == 0x1511) {
				val &= ~0x10;	 //remove ML
				val |= 0xC0;		//force penguin 180 rotation
			}
//			val &= (_lcd_ID == 0x1963) ? ~0xC0 : ~0xD0; //MY=0, MX=0 with ML=0 for ILI9481
			goto common_MC;
		} else if (is8347) {
			_MC = 0x02, _MP = 0x06, _MW = 0x22, _SC = 0x02, _EC = 0x04, _SP = 0x06, _EP = 0x08;
			if (_lcd_ID == 0x5252) {
				val |= 0x02;	 //VERT_SCROLLON
				if (val & 0x10) {
					val |= 0x04;	 //if (ML) SS=1 kludge mirror in XXX_REV modes
				}
			}
			goto common_BGR;
		}
common_MC:
		_MC = 0x2A, _MP = 0x2B, _MW = 0x2C, _SC = 0x2A, _EC = 0x2A, _SP = 0x2B, _EP = 0x2B;
common_BGR:
		WriteCmdParamN(is8347 ? 0x16 : 0x36, 1, &val);
		_lcd_madctl = val;
	} else {
		uint16_t GS, SS, ORG, REV = _lcd_rev;
		switch (_lcd_ID) {
		case 0x5420:
		case 0x7793:
		case 0x9326:
		case 0xB509:
			_MC = 0x200, _MP = 0x201, _MW = 0x202, _SC = 0x210, _EC = 0x211, _SP = 0x212, _EP = 0x213;
			GS = (val & 0x80) ? (1 << 15) : 0;
			uint16_t NL;
			NL = ((432 / 8) - 1) << 9;
			if (_lcd_ID == 0x9326 || _lcd_ID == 0x5420) {
				NL >>= 1;
			}
			WriteCmdData(0x400, GS | NL);
			goto common_SS;

		default:
			_MC = 0x20, _MP = 0x21, _MW = 0x22, _SC = 0x50, _EC = 0x51, _SP = 0x52, _EP = 0x53;
			GS = (val & 0x80) ? (1 << 15) : 0;
			WriteCmdData(0x60, GS | 0x2700);		// Gate Scan Line (0xA700)
common_SS:
			SS = (val & 0x40) ? (1 << 8) : 0;
			WriteCmdData(0x01, SS);		 // set Driver Output Control
common_ORG:
			ORG = (val & 0x20) ? (1 << 3) : 0;
			if (val & 0x08) {
					ORG |= 0x1000;	//BGR
			}
			_lcd_madctl = ORG | 0x0030;
			WriteCmdData(0x03, _lcd_madctl);		// set GRAM write direction and BGR=1.
			break;
		}
	}

	if ((rotation & 1) && ((_lcd_capable & MV_AXIS) == 0)) {
		uint16_t x;
		x = _MC, _MC = _MP, _MP = x;
		x = _SC, _SC = _SP, _SP = x;		//.kbv check 0139
		x = _EC, _EC = _EP, _EP = x;		//.kbv check 0139
	}

	setAddrWindow(0, 0, width() - 1, height() - 1);
	vertScroll(0, HEIGHT, 0);	 //reset scrolling after a rotation
}

void STM32_TFT_8bit::vertScroll(int16_t top, int16_t scrollines, int16_t offset)
{
	if (_lcd_offset) {
		if (rotation == 2 || rotation == 3) {
			top += _lcd_offset;
		}
	}
	int16_t bfa = HEIGHT - top - scrollines;	// bottom fixed area
	int16_t vsp;
	int16_t sea = top;
	if (_lcd_ID == 0x9327) {
		bfa += 32;
	}
	if (offset <= -scrollines || offset >= scrollines) {
		offset = 0; //valid scroll
	}
	vsp = top + offset; // vertical start position
	if (offset < 0) {
			vsp += scrollines;					//keep in unsigned range
	}
	sea = top + scrollines - 1;
	if (_lcd_capable & MIPI_DCS_REV1) {
		uint8_t d[6];					 // for multi-byte parameters
		d[0] = top >> 8;				//TFA
		d[1] = top;
		d[2] = scrollines >> 8;			//VSA
		d[3] = scrollines;
		d[4] = bfa >> 8;				//BFA
		d[5] = bfa;
		WriteCmdParamN(is8347 ? 0x0E : 0x33, 6, d);
		d[0] = vsp >> 8;				//VSP
		d[1] = vsp;
		WriteCmdParamN(is8347 ? 0x14 : 0x37, 2, d);
		if (is8347) { 
			d[0] = (offset != 0) ? (_lcd_ID == 0x8347 ? 0x02 : 0x08) : 0;
			WriteCmdParamN(_lcd_ID == 0x8347 ? 0x18 : 0x01, 1, d);	//HX8347-D
		} else if (offset == 0 && (_lcd_capable & MIPI_DCS_REV1)) {
			WriteCmdParamN(0x13, 0, NULL);		//NORMAL i.e. disable scroll
		}
		return;
	} else {
		if (top != 0) return;
		// cope with 9320 style variants:
		switch (_lcd_ID) {
		case 0x7783:
			WriteCmdData(0x61, _lcd_rev);	 //!NDL, !VLE, REV
			WriteCmdData(0x6A, vsp);				//VL#
			break;
		case 0x5420:
		case 0x7793:
		case 0x9326:
		case 0xB509:
			WriteCmdData(0x401, (1 << 1) | _lcd_rev);			 //VLE, REV 
			WriteCmdData(0x404, vsp);			 //VL# 
			break;
		default:
			// 0x6809, 0x9320, 0x9325, 0x9335, 0xB505 can only scroll whole screen
			WriteCmdData(0x61, (1 << 1) | _lcd_rev);				//!NDL, VLE, REV
			WriteCmdData(0x6A, vsp);				//VL#
			break;
		}
	}
}

void STM32_TFT_8bit::invertDisplay(boolean i)
{
	uint8_t val;
	_lcd_rev = ((_lcd_capable & REV_SCREEN) != 0) ^ i;

	if (_lcd_capable & MIPI_DCS_REV1) {
		if (is8347) {
			// HX8347D: 0x36 Panel Characteristic. REV_Panel
			// HX8347A: 0x36 is Display Control 10
			if (_lcd_ID == 0x8347 || _lcd_ID == 0x5252) { // HX8347-A, HX5352-A
				val = _lcd_rev ? 6 : 2;			 //INVON id bit#2,	NORON=bit#1
			} else {
				val = _lcd_rev ? 8 : 10;		 //HX8347-D, G, I: SCROLLON=bit3, INVON=bit1
			}
			// HX8347: 0x01 Display Mode has diff bit mapping for A, D 
			WriteCmdParamN(0x01, 1, &val);
		} else {
			WriteCmdParamN(_lcd_rev ? 0x21 : 0x20, 0, NULL);
		}
		return;
	}
	// cope with 9320 style variants:
	switch (_lcd_ID) {
	case 0x9225:																				//REV is in reg(0x07) like Samsung
	case 0x9226:
	case 0x0154:
		WriteCmdData(0x07, 0x13 | (_lcd_rev << 2));		 //.kbv kludge
		break;
	case 0x5420:
	case 0x7793:
	case 0x9326:
	case 0xB509:
		WriteCmdData(0x401, (1 << 1) | _lcd_rev);			 //.kbv kludge VLE 
		break;
	default:
		WriteCmdData(0x61, _lcd_rev);
		break;
	}
}

uint8_t STM32_TFT_8bit::read8(void)
{
	RD_ACTIVE;
	delay(5);
	uint8_t temp = (TFT_DATA->IDR & 0x00FF);
	RD_IDLE;
	delay(5);
	return temp;
}

uint16_t STM32_TFT_8bit::read16bits(void)
{
	uint16_t ret;
	uint8_t lo;
	uint8_t hi;
	CS_ACTIVE;
	CD_DATA;
	hi = read8();
	//all MIPI_DCS_REV1 style params are 8-bit
	lo = read8();
	CS_IDLE;
	return (hi << 8) | lo;
}

uint16_t STM32_TFT_8bit::readReg16(uint16_t reg)
{
	uint16_t ret;
	uint8_t lo;
	setWriteDataBus();
	writeCmdWord(reg);
	setReadDataBus();
	//		READ_16(ret);
	ret = read16bits();
	setWriteDataBus();
	return ret;
}

uint16_t STM32_TFT_8bit::readReg16Index(uint16_t reg, int8_t index)
{
	uint16_t ret;
	uint8_t lo;
	setWriteDataBus();
	writeCmdByte(reg);
	setReadDataBus();
	//		READ_16(ret);
	do { ret = read16bits(); }while (--index >= 0);	//need to test with SSD1963
	setWriteDataBus();
	return ret;
}

uint32_t STM32_TFT_8bit::readReg32(uint16_t reg)
{
	uint16_t h = readReg16Index(reg, 0);
	uint16_t l = readReg16Index(reg, 1);
	return ((uint32_t) h << 16) | (l);
}

uint32_t STM32_TFT_8bit::readReg40(uint16_t reg)
{
	uint16_t h = readReg16Index(reg, 0);
	uint16_t m = readReg16Index(reg, 1);
	uint16_t l = readReg16Index(reg, 2);
	return ((uint32_t) h << 24) | (m << 8) | (l >> 8);
}

uint16_t STM32_TFT_8bit::readID(void)
{
	uint16_t ret, ret2;
	uint8_t msb;
	ret = readReg16(0);					 //forces a reset() if called before begin()
	if (ret == 0x5408) {					//the SPFD5408 fails the 0xD3D3 test.
		return 0x5408;
	}
	if (ret == 0x5420) {					//the SPFD5420 fails the 0xD3D3 test.
		return 0x5420;
	}
	if (ret == 0x8989) {					//SSD1289 is always 8989
		return 0x1289;
	}
	ret = readReg16(0x67);				//HX8347-A
	if (ret == 0x4747) {
		return 0x8347;
	}

	ret = readReg32(0xA1);			//SSD1963: [01 57 61 01]
	if (ret == 0x6101) {
		return 0x1963;
	}
	if (ret == 0xFFFF) {					//R61526: [xx FF FF FF]
		return 0x1526;					//subsequent begin() enables Command Access
	}
//	if (ret == 0xFF00) {					//R61520: [xx FF FF 00]
//		return 0x1520;					//subsequent begin() enables Command Access
//	}

