leandroschwarz/funsapeLib/_stuff/loose_files/(DEVICE)[CHECK]tftDisplay/STM32_TFT_8bit (2).cpp
	ret = readReg40(0xBF);
	if (ret == 0x8357) {					//HX8357B: [xx 01 62 83 57 FF]
		return 0x8357;
	}
	if (ret == 0x9481) {					//ILI9481: [xx 02 04 94 81 FF]
		return 0x9481;
	}
	if (ret == 0x1511) {					//?R61511: [xx 02 04 15 11] not tested yet
		return 0x1511;
	}
	if (ret == 0x1520) {					//?R61520: [xx 01 22 15 20]
		return 0x1520;
	}
	if (ret == 0x1526) {					//?R61526: [xx 01 22 15 26]
		return 0x1526;
	}
	if (ret == 0x1581) {					//R61581:	[xx 01 22 15 81]
		return 0x1581;
	}
	if (ret == 0x1400) {					//?RM68140:[xx FF 68 14 00] not tested yet
		return 0x6814;
	}
	ret = readReg32(0xD4);
	if (ret == 0x5310) {					//NT35310: [xx 01 53 10]
		return 0x5310;
	}
	ret = readReg40(0xEF);			//ILI9327: [xx 02 04 93 27 FF] 
	if (ret == 0x9327) {
		return 0x9327;
	}
	ret = readReg32(0xFE) >> 8; //weird unknown from BangGood [04 20 53] 
	if (ret == 0x2053) {
		return 0x2053;
	}
	uint32_t ret32 = readReg32(0x04);
	msb = ret32 >> 16;
	ret = ret32;	
//		if (msb = 0x38 && ret == 0x8000) //unknown [xx 38 80 00] with D3 = 0x1602
//		if (msb == 0xFF && ret == 0xFFFF) //R61526 [xx FF FF FF]
//				return 0x1526;					//subsequent begin() enables Command Access
	if (ret == 0x1526) {					//R61526 [xx 06 15 26] if I have written NVM
		return 0x1526;					//subsequent begin() enables Command Access
	}
	if (ret == 0x8552) {					//ST7789V: [xx 85 85 52]
		return 0x7789;
	}
	if (ret == 0xAC11) {					//?unknown [xx 61 AC 11]
		return 0xAC11;
	}
//		if (msb == 0x54 && ret == 0x8066)	//RM68140:[xx 54 80 66] But Many different controllers will return same value.
//				return 0x6814;
	ret = readReg32(0xD3);			//for ILI9488, 9486, 9340, 9341
	msb = ret >> 8;
	if (msb == 0x93 || msb == 0x94 || msb == 0x98 || msb == 0x77 || msb == 0x16) {
		return ret;						 //0x9488, 9486, 9340, 9341, 7796
	}
	if (ret == 0x00D3 || ret == 0xD3D3) {
		return ret;						 //16-bit write-only bus
	}
	ret = readReg16(0);					//0154, 7783, 9320, 9325, 9335, B505, B509
	return ret;
}
